In [23]:
import sqlite3

In [ ]:
## QUESTÃO 1 e 2

In [44]:
conexao= sqlite3.connect('DB_Cursos_BC')
cursor= conexao.cursor()

## Criação da Tabela alunos no banco de dados

cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100))')

## Insert na tabela alunos 

cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (1, "Pâmela J.", 30, "Engenharia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (2, "Paula B.", 22, "Engenharia")')#cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (3, "João T.", 27, "Nutrição")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (3, "Juan A.", 24, "Engenharia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (4, "Maria Luiza A.", 23, "Medicina")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (5, "Pedro J.", 24, "Matemática")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (6, "Matheus F.", 32, "Direito")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (7, "Marlene T.", 45, "Matemática")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (8, "Juliana M.", 21, "Direito")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (9, "Fabio F.", 20, "Administração")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (10, "Pedro M.", 35, "Engenharia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (11, "Letícia S.", 28, "Física")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (12, "Marcus G.", 23, "Biologia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (13, "Tatiana M.", 26, "Ciência da Computação")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (14, "Talles K.", 19, "Engenharia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES (15, "Viviane V.", 18, "Engenharia")')


conexao.commit()
conexao.close()

In [ ]:
## QUESTÃO 3 (a, b, c e d)

In [54]:
conexao= sqlite3.connect('DB_Cursos_BC')
cursor= conexao.cursor()

### Consultas Básicas (Todos os registros da tabela alunos)

dados= cursor.execute('SELECT * FROM  alunos')
print('Todos os registros da tabela alunos: \n')

for usuario in dados:
    print(usuario)


print('\n')
    

### Consultas Básicas (Alunos com mais de 20 anos)

dados= cursor.execute('SELECT nome, idade FROM  alunos where idade > 20')

print('Alunos com mais de 20 anos: \n')

for usuario in dados:
    print(usuario)

print('\n')
    
    
### Consultas Básicas (Alunos Engenharia | Ordem Alfabética)

dados= cursor.execute('SELECT * FROM  alunos where curso = "Engenharia"  order by nome asc')

print('Alunos da Engenharia em ordem alfabética: \n')

for usuario in dados:
    print(usuario)

print('\n')

### Consultas Básicas (Contagem total de alunos da tabela)

cursor.execute('SELECT COUNT(id) FROM  alunos')

print('Contagem total de alunos da tabela: \n')

count= cursor.fetchone()[0]
print(count)


conexao.commit()
conexao.close()

Todos os registros da tabela alunos:

(1, 'Pâmela J.', 30, 'Engenharia')
(2, 'Paula B.', 22, 'Engenharia')
(3, 'Juan A.', 24, 'Engenharia')
(4, 'Maria Luiza A.', 23, 'Medicina')
(5, 'Pedro J.', 24, 'Matemática')
(6, 'Matheus F.', 32, 'Direito')
(7, 'Marlene T.', 45, 'Matemática')
(8, 'Juliana M.', 21, 'Direito')
(9, 'Fabio F.', 20, 'Administração')
(10, 'Pedro M.', 35, 'Engenharia')
(11, 'Letícia S.', 28, 'Física')
(12, 'Marcus G.', 23, 'Biologia')
(13, 'Tatiana M.', 26, 'Ciência da Computação')
(14, 'Talles K.', 19, 'Engenharia')
(15, 'Viviane V.', 18, 'Engenharia')


Alunos com mais de 20 anos:

('Pâmela J.', 30)
('Paula B.', 22)
('Juan A.', 24)
('Maria Luiza A.', 23)
('Pedro J.', 24)
('Matheus F.', 32)
('Marlene T.', 45)
('Juliana M.', 21)
('Pedro M.', 35)
('Letícia S.', 28)
('Marcus G.', 23)
('Tatiana M.', 26)


Alunos da Engenharia em ordem alfabética:

(3, 'Juan A.', 24, 'Engenharia')
(2, 'Paula B.', 22, 'Engenharia')
(10, 'Pedro M.', 35, 'Engenharia')
(1, 'Pâmela J.', 30, 'Engenharia')
(14, 'Talles K.', 19, 'Engenharia')
(15, 'Viviane V.', 18, 'Engenharia')


Contagem total de alunos da tabela:

15

In [ ]:
## QUESTÃO 4

In [57]:
conexao= sqlite3.connect('DB_Cursos_BC')
cursor= conexao.cursor()

### Atualização da idade

cursor.execute('UPDATE alunos SET idade= 23 where id=3')

### Remover um aluno pelo id

cursor.execute('DELETE FROM alunos where id=6')

conexao.commit()
conexao.close()

In [ ]:
## QUESTÃO 5

In [64]:
conexao= sqlite3.connect('DB_Cursos_BC')
cursor= conexao.cursor()

## Criação da Tabela clientes no banco de dados

cursor.execute('CREATE TABLE clientes(id INT PRIMARY KEY , nome VARCHAR(100), idade INT, saldo FLOAT)')

## Insert na tabela clientes

cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (1, "Pâmela J.", 30, 5300.30)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (2, "Paula B.", 22, 4258.02)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (3, "Juan A.", 24, 3697.57)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (4, "Maria Luiza A.", 23, 10325.89)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (5, "Pedro J.", 24, 2359.74)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (6, "Matheus F.", 32, 1235.40)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (7, "Marlene T.", 45, 25328.97)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (8, "Juliana M.", 21, 7325.48)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (9, "Fabio F.", 20, 532.45)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (10, "Pedro M.", 35, 329.88)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (11, "Letícia S.", 28, 9587.42)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (12, "Marcus G.", 23, 35763.68)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (13, "Tatiana M.", 26, 5238.78)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (14, "Talles K.", 19, 1345.98)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES (15, "Viviane V.", 18, 6758.50)')


conexao.commit()
conexao.close()

In [ ]:
## QUESTÃO 6 (a, b, c e d)

In [76]:
conexao= sqlite3.connect('DB_Cursos_BC')
cursor= conexao.cursor()


### Clientes com mais de 30 anos)

dados= cursor.execute('SELECT nome, idade FROM  clientes where idade > 30')

print('Clientes com mais de 30 anos: \n')

for usuario in dados:
    print(usuario)

print('\n')
    
    
### Saldo Médio dos Clientes

dados= cursor.execute('SELECT AVG(saldo) FROM  clientes')

print('Saldo médio dos clientes é de: \n')

dados= round(cursor.fetchone()[0],2)
print(dados)

print('\n')


### Cliente com saldo máximo

cursor.execute('SELECT id, nome, max(saldo) as maior_saldo FROM clientes')


print('Cliente com o maior saldo é: \n')

max_saldo= cursor.fetchall() 

print(max_saldo)

print('\n')


### Quantos clientes tem saldo acima de 1000

cursor.execute('SELECT COUNT(id) FROM clientes where saldo > 1000.00')

print('Total de clientes com saldo acima de 1000: \n')

count= cursor.fetchone()[0]
print(count)



conexao.commit()
conexao.close()

Clientes com mais de 30 anos:

('Matheus F.', 32)
('Marlene T.', 45)
('Pedro M.', 35)


Saldo médio dos clientes é de:

7959.2


Cliente com o maior saldo é:

[(12, 'Marcus G.', 35763.68)]


Total de clientes com saldo acima de 1000:

13

In [ ]:
## QUESTÃO 7

In [79]:
conexao= sqlite3.connect('DB_Cursos_BC')
cursor= conexao.cursor()

### Atualização do saldo

cursor.execute('UPDATE clientes SET saldo= 12359.74 where id=5')

### Remover um cliente pelo id

cursor.execute('DELETE FROM clientes where id=14')

conexao.commit()
conexao.close()

In [ ]:
## QUESTÃO 8

In [82]:

###Criação da tabela compras

conexao= sqlite3.connect('DB_Cursos_BC')
cursor= conexao.cursor()

## Criação da Tabela compras no banco de dados

cursor.execute('CREATE TABLE compras(id INT PRIMARY KEY, cliente_id INT, produto VARCHAR(100), valor REAL, FOREIGN KEY(cliente_id) REFERENCES clientes(id))')

## Insert na tabela compras

cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (101, 3, "Calça", 100.30)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (102, 1, "Camisa", 42.90)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (103, 5, "Sapatos", 97.87)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (104, 8, "Acessórios", 33.57)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (105, 11, "Cinto", 28.75)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (106, 12, "Vestido", 325.00)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (107, 12, "Saia", 253.37)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (108, 3, "Short", 83.80)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (109, 13, "Legging", 32.50)')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES (110, 5, "Tênis", 145.80)')


conexao.commit()
conexao.close()

In [83]:
#Junção de Tabelas 

conexao= sqlite3.connect('DB_Cursos_BC')
cursor= conexao.cursor()

dados= cursor.execute('select a.nome,c.produto, c.valor from clientes a inner join compras c on (a.id = c.cliente_id)')

for usuario in dados:
    print(usuario)

    
conexao.commit()
conexao.close()

('Juan A.', 'Calça', 100.3)
('Pâmela J.', 'Camisa', 42.9)
('Pedro J.', 'Sapatos', 97.87)
('Juliana M.', 'Acessórios', 33.57)
('Letícia S.', 'Cinto', 28.75)
('Marcus G.', 'Vestido', 325.0)
('Marcus G.', 'Saia', 253.37)
('Juan A.', 'Short', 83.8)
('Tatiana M.', 'Legging', 32.5)
('Pedro J.', 'Tênis', 145.8)